#include "51_SolveNQueens.h"
#include "math.h"
#include <algorithm>
#include <queue>
#include <stack>
#include <unordered_map>


/***********************************************************
 * 51  n皇后问题
********************************************************************/

/******************************************************************
输入：n = 4
输出：[[".Q..","...Q","Q...","..Q."],["..Q.","Q...","...Q",".Q.."]]
解释：如上图所示，4 皇后问题存在两个不同的解法。


 *******************************************************************/
// std::vector<std::vector<std::string>> Solution51::solveNQueens(int n){



//     return n%2 == 0 ? y*y : y*y*x;
// }
