#include "62_UniquePaths.h"
#include "math.h"
#include <algorithm>
#include <queue>
#include <stack>
#include <unordered_map>


// 62 不同路径
/*******************************************************************************************
一个机器人位于一个 m x n 网格的左上角 （起始点在下图中标记为 “Start” ）。

机器人每次只能向下或者向右移动一步。机器人试图达到网格的右下角（在下图中标记为 “Finish” ）。

问总共有多少条不同的路径？

====================================================================
输入：m = 3, n = 7
输出：28
====================================================================

输入：m = 3, n = 2
输出：3
解释：
从左上角开始，总共有 3 条路径可以到达右下角。
1. 向右 -> 向下 -> 向下
2. 向下 -> 向下 -> 向右
3. 向下 -> 向右 -> 向下
====================================================================

输入：m = 3, n = 3
输出：6
*********************************************************************************************/

int Solution62::uniquePaths(int m, int n){
    std::vector<std::vector<int> > dp(m, std::vector<int>(n, 0));

    for(int i = 0; i < m; i++){
        dp[i][0] = 1;
    }

    for(int j = 0; j < n; j++){
        dp[0][j] = 1;
    }

    for(int row=1; row<m; row++){
        for(int col=1; col<n; col++){
            dp[row][col] = dp[row-1][col] + dp[row][col-1];
        }
    }

    return dp[m-1][n-1];
 
}

